# ========== Taps ==========
tap "dotenvx/brew"
tap "jandedobbeleer/oh-my-posh"

# ========== CLI Tools ==========
# Core utilities
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"

# Shell enhancements
brew "fzf"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
brew "zoxide"

# File & system utilities
brew "dust"
brew "duf"
brew "entr"
brew "eza"
brew "hwatch"
brew "stow"
brew "the_platinum_searcher"

# Network tools
brew "aria2"
brew "sshuttle"

# Development tools
brew "awscli"
brew "docker"
brew "gh"
brew "go"
brew "jq"
brew "pass"
brew "dotenvx/brew/dotenvx"

# Kubernetes tools
brew "helm"
brew "kind"
brew "kubernetes-cli"
brew "stern"

# ========== Applications ==========
# Terminals & editors
cask "cursor"
cask "iterm2"
cask "visual-studio-code"

# Browsers
cask "arc"

# Development environments
cask "orbstack"

# Media
cask "vlc"


# ========== System ==========

# Fonts
cask "font-monaspace"

# Utilities
cask "keepingyouawake"
cask "keyboardcleantool"
cask "shottr"
